app/views/tasks/index.html.erb

  // Handle Turbo method links (like the toggle complete links)
  document.addEventListener('click', function(event) {
    const link = event.target.closest('a[data-turbo-method]');
    if (link && link.href.includes('/tasks/')) {
      document.getElementById('tasks-loading').classList.remove('d-none');
    }
  });
---
SELECT "tasks".* FROM "tasks"