app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", true], ["updated_at", "2026-01-14 00:01:37.551611"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)